export const goods = [
        {
          "id": 1,
          "name":"苹果",      
          "price": 7.5,
          "image": "apple.png",      
          "description": "苹果（Malus pumila Mill.），蔷薇科苹果属落叶乔木植物，茎干较高，小枝短而粗，呈圆柱形；叶片椭圆形，表面光滑，边缘有锯齿，叶柄粗壮；花朵较小呈伞状，淡粉色，表面有绒毛；果实较大，呈扁球形，果梗短粗；花期5月；果期7~10月。 [4]苹果名称最早是见于明代王世懋的《学圃余疏》“北土之苹婆果，即花红一种之变也。"
        },
        {
          "id": 2,
          "name":"香蕉",      
          "price": 8,
          "image": "banana.png",      
          "description": "香蕉（Musa nana Lour.），芭蕉科芭蕉属多年生草本植物，植株丛生，有匍匐茎；假茎浓绿有黑色斑点；叶片长圆形，上面为深绿色，无白粉，下面浅绿色；花朵为乳白色或淡紫色；果实呈弯曲的弓状，有棱，果皮为青绿色，成熟后变黄；果肉松软，黄白色，味甜香味浓，无种子。"
        },
        {
          "id": 3,
          "name": "猕猴桃",      
          "price": 15,
          "image": "tao.png",      
          "description": "中华猕猴桃（Actinidia chinensis Planch.）别名羊桃藤、阳桃、羊桃等，是猕猴桃科猕猴桃属的大型落叶藤本植物 [1] [16]。中华猕猴桃幼枝被毛，老时秃净或留有断损残毛，隔年枝完全秃净无毛；叶纸质，倒阔卵形至倒卵形或阔卵形至近圆形，密被灰白色或淡褐色星状绒毛；聚伞花序，苞片小，花开放后，由白色变为淡黄色；浆果黄褐色，近球形、圆柱形、倒卵形或椭圆形；种子纵径2.5毫米 [1] [11]。花期6-7月，果期8-9月"
        },
      ];

        export const getGoodById = id => {
                return goods.find(good => good.id === id);
        }
        export const cargoods = []
              
    